<!DOCTYPE HTML>
<html>

<head>
    <title>C&oacute;mputo Distribuido</title>
    <meta name="description" content="Sitio especializado al cuerpo academico Computo Distribuido" />
  <meta name="keywords" content="Cómputo Distribuido, Fernando Pech May, Luis Antonio Lopez Gomez, Edna Mariel Mill Chontal,
  Manuel Segovia López, Jorge Magaña Govea, Instituto Tecnológico Superior de los Rios, Sistemas Distribuidos, Web Semántica, 
  Procesamiento de lenguaje natural, Recuperación de información, Proyectos, Inteligencia Artificial, ITSR, Cuerpo Académico, 
  ITSR Balancan, Sistemas computacionales" />
  <meta name=”Language” content=”Spanish”/>
  <meta name="Distribution" content="Global"/>
  <meta name="robots" content="index,follow,all"/>
  <meta http-equiv="content-type" content="text/html; charset=windows-1252" />
    <link rel="stylesheet" type="text/css" href="css/estyle.css" title="style" />
</head>

<body>
    <div id="main">
        <div id="header">
            <div id="logo">

                <br>
                <img style="width:300px; margin-left: 100px" src="img/logo.png" />

            </div>
            <div id="menubar">
                <ul id="menu">

                    <li>
                        <a href="index.html">Inicio</a>
                    </li>
                    <li>
                        <a href="nosotros.html">Nosotros</a>
                    </li>
                    <li>
                        <a href="profesores.html">Profesores</a>
                    </li>
                    <li>
                        <a href="Ainvestigacion.html">Areas de investigaci&oacute;n</a>
                    </li>
                    <li>
                        <a href="proyectos.html">Proyectos</a>
                    </li>
                    <li>
                        <a href="publicaciones.html">Publicaciones</a>
                    </li>
                    <li>
                        <a href="recursos.html">Recursos</a>
                    </li>
                </ul>
            </div>
        </div>
        <div id="site_content">
            <div class="sidebar">

                <h4 style="font-weight: bold"> Buscar </h4>
                <form method="post" action="#" id="search_form">
                    <p>
                        <input class="search" type="text" name="search_field" value="Buscar" />
                        <input name="search" type="image" style="border: 0; margin: 0 0 -9px 5px;" src="img/lupa3.png" alt="Search" title="Search"
                        />
                    </p>
                </form>

                <h4 style="font-weight: bold">Visitas</h4>

                <a href="http://www.clustrmaps.com/map/Itsr.edu.mx" title="Visit tracker for Itsr.edu.mx">
                    <img src="http://www2.clustrmaps.com/stats/maps-no_clusters/www.itsr.edu.mx-fpech-thumb.jpg" alt="Visitas a Itsr.edu.mx" />
                </a>


                <br>
                <br>
                <h4 style="font-weight: bold">Temas de interes</h4>

                <a href="https://www.researchgate.net/publication/233425513_LA_WEB_SEMANTICA_UNA_BREVE_REVISION">web semantica</a>
                <br>
                <br>
                <a href="https://www.foroconsultivo.org.mx/INCyTU/documentos/Completa/INCYTU_18-012.pdf">Inteligencia Artificial</a>
                <br>
                <br>
                <a href="https://www.tuinteligenciaartificial.es/las-redes-neuronales-en-la-inteligencia-artificial-explicacion-clara-y-sencilla/">Redes Neuronales</a>
                <br>
                <br>

                <h4 style="font-weight: bold">Proyectos de:</h4>

                <p style="color:#333">titulaci&oacute;n
                    <br />
                    <a href="titulacion.html">Leer mas</a>
                </p>


            </div>
            <div id="content">
                <!-- Contenido -->
                <h2 style="text-align: center">PROYECTOS</h2>

                <button class="accordion" style="font-weight: bold; color:aliceblue">Herramientas para la Conversi&oacute;n de consultas en Lenguaje Natural a expresiones SPARQL.</button>
                <div class="panel">
                    <p style="text-align: justify; line-height: 1.5;font-size: 14px; color: #47433F" >El ingreso de texto en Lenguaje Natural (LN) ha resultado una actividad importante, siendo este uno de los medios de comunicaci&oacute;n entre personas y m&aacute;quinas.
                         El procesamiento de Lenguaje Natural (PLN) procesa ese texto plano. 
                        Debido a la gran cantidad de informaci&oacute;n en la web, se ha iniciado en estructurarlo de una manera distinta, a causa de esto se ha creado la web sem&aacute;ntica, 
                        en donde intenta transformar esta informaci&oacute;n en conocimiento formal. Para esta formalizaci&oacute;n se utilizan las ontolog&iacute;as. <br><br>
                        
                        La ontolog&iacute;a es una forma de representar conocimiento en forma de grafos,  sin embargo para consultarlos es necesario utilizar expresiones formales, entre las que destaca SPARQL.

                        Ser&iacute;a de gran utilidad hacer una transformaci&oacute;n de texto en lenguaje natural a expresiones en SPARQL para hacer m&aacute;s eficiente las b&uacute;squedas y para ayudar al usuario con nulo 
                        conocimiento en web sem&aacute;ntica. Actualmente se han presentado distintas propuestas o enfoques para transformar LN a SPARQL. Bajo este contexto es necesario analizar las
                         herramientas m&acute;s utilizadas y conocer la eficiencia de cada una.

                        <br><br> La web sem&aacute;ntica intenta elevar el significado de los elementos y recursos que est&aacute;n disponibles en la web, 
                        en donde no s&oacute;lo se almacenan los datos sino que es capaz de entender el sentido de la informaci&oacute;n.
                        </p>
                </div>
<br><br>
                <button class="accordion" style="font-weight: bold; color:aliceblue">Comparativa de sublenguajes OWL: OWL-Lite, OWL-DL y OWL-Full.</button>
                <div class="panel">
                    <p style="text-align: justify; line-height: 1.5;font-size: 14px; color: #47433F" >La representaci&oacute;n del conocimiento consiste en describir las entidades de un dominio utilizando un lenguaje formal. Las ontolog&iacute;as se han propuesto como una estrategia para formalizar la representaci&oacute;n del conocimiento y su promoci&oacute;n y reutilizaci&oacute;n. Una ontolog&oacute;a es una descripci&oacute;n formal y expl&iacute;cita de los conceptos de un dominio del discurso. Actualmente Existen lenguajes para dise&ntilde;ar/desarrollar ontolog&iacute;a tales como RDF, RDFS, XMLS, XML, DAML+OIL y OWL. 

                            <br><br>OWL es el lenguaje m&aacute;s   utilizados y consta de tres sub-lenguajes OWL lite, OWL-DL y OWL-Full, cada uno con distintos niveles de expresividad y dise&ntilde;ados para ser usados por comunidades espec&iacute;ficas de desarrolladores y usuarios. OWL Lite est&aacute; dirigido a usuarios que solo necesiten una clasificaci&oacute;n jer&aacute;rquica con una serie de restricciones simples,  OWL-DL para el razonamiento autom&aacute;tico, clasificaci&oacute;n de jerarqu&iacute;as y detecci&oacute;n de inconsistencias en las ontolog&iacute;as y OWL Full est&aacute; dirigido para usuarios que quieren la m&aacute;xima expresividad y la libertad sint&aacute;ctica que permite RDF, pero sin garant&iacute;as computacionales. 

                           <br><br>Cada uno de estos sub-lengujes tienen distintos niveles de expresividad por lo que es necesario e importante analizar cada uno de ellos para para visualizar cual es el alcance de su expresividad en sus construcciones, migraci&oacute;n, taxonom&iacute;a, etc. En este Trabajo se pretende realizar un an&aacute;lisis de cada uno de los sublengujes para diferenciar su expresividad. De modo que sirva como base para decidir el mejor lenguaje utilizar dependiendo de las necesidades del usuario.
                            </p>
                </div>
<br><br>
                <button class="accordion" style="font-weight: bold; color:aliceblue">An&aacute;lisis de metodolog&iacute;as implementadas en el desarrollo de ontolog&iacute;as.</button>
                <div class="panel">
                    <p style="text-align: justify; line-height: 1.5;font-size: 14px; color: #47433F" >En los &uacute;ltimos a&ntilde;os se ha incrementado el uso de tecnolog&iacute;as sem&aacute;nticas en el desarrollo de sistemas de informaci&oacute;n organizacionales. Entre dichas tecnolog&iacute;as se destacan las ontolog&iacute;as, las cuales han demostrado brindar beneficios importantes en un amplio espectro de contextos y aplicaciones.
                            <br>Para el dise&ntilde;o de cualquier ontolog&iacute;a es necesario contar con una metodolog&iacute;a espec&iacute;fica. Existen varios tipos de &aacute;reas en las que se encuentra plasmado las ontolog&iacute;as, la web sem&aacute;ntica es una de las &aacute;reas de las cuales m&aacute;s se encuentra ligado este modelado. Para construir la Web sem&aacute;ntica se necesita poder representar el conocimiento de forma que sea legible por los ordenadores, est&eacute; consensuado, y sea reutilizable. Las ontolog&iacute;as proporcionan la v&iacute;a para representar este conocimiento.
                            
                           <br>En este caso se necesita generar un listado de modelos para poder hacer las representaciones, y de igual manera hacer un an&aacute;lisis de las posibles metodolog&iacute;as que se pueden aplicar en el &aacute;rea mencionada. 
                            
                            <br>A trav&eacute;s de este proyecto se pretende realizar un estudio de las metodolog&iacute;as aplicables al desarrollo de ontolog&iacute;as que genere una gu&iacute;a para el desarrollo de &eacute;stas, considerando modelos, lenguajes m&eacute;todos y patrones de contenido para la definici&oacute;n de reglas sem&aacute;nticas.
          </p>
                </div>
<br><br>
                <button class="accordion" style="font-weight: bold; color:aliceblue">Desarrollo de una ontolog&iacute;a mediante el uso motores sem&aacute;nticos.</button>
                <div class="panel">
                    <p style="text-align: justify; line-height: 1.5;font-size: 14px; color: #47433F" >Las ontolog&iacute;as son uno de los n&uacute;cleos esenciales de la web sem&aacute;ntica ya que permiten modelar y relacionar recursos de informaci&oacute;n de un modo muy preciso y con una l&oacute;gica sem&aacute;ntica muy formalizada, para describir y representar un &aacute;rea de conocimiento. <br><br>
                            Sin embargo, se necesita que ese conocimiento est&eacute; representado de forma que sea legible por los ordenadores, est&eacute; consensuado, y sea reutilizable. Por lo tanto, las wikis sem&aacute;nticas son una manera de capturar o identificar esa informaci&oacute;n o conocimiento acerca de los datos dentro de sus p&aacute;ginas y las relaciones entre estas, se consideran herramientas altamente colaborativas, eso hace que los usuarios consulten los datos puedan ampliarlos, borrarlos o modificarlos.
                            <br><br> Es importante destacar que existen diferentes motores de wiki sem&aacute;ntica entre los m&aacute;s destacados se encuentran Acewiki, Wikidsmart, Semantic MediaWiki, OntoWiki etc., de las cuales se opt&oacute; por Ontowiki como un editor de ontolog&iacute;as y un sistema de adquisici&oacute;n de conocimientos. Al ser un wiki que permite la administraci&oacute;n del conocimiento generado en la web sem&aacute;ntica. Este conocimiento es organizado mediante una interfaz simple e intuitiva, manipulando clases, propiedades y recursos. <br> <br>La visualizaci&oacute;n de la base de conocimiento es una especie de mapa de informaci&oacute;n, con diferentes puntos de vista sobre los datos instanciados. 
                            Sobre la herramienta wiki se cargar&aacute; una ontolog&iacute;a, el cual permitir&aacute; analizar su funcionamiento, almacenamiento de informaci&oacute;n, como se añade informaci&oacute;n sem&aacute;ntica, como importar ontolog&iacute;as, creaci&oacute;n de consultas, modificaci&oacute;n de etiquetas etc. Posteriormente, validar la utilidad de la herramienta, sus puntos fuertes y sus carencias, y como resultado pueda ser consultada desde OntoWiki desde la url.
                            <br><br>
                            <li style="text-align: justify; line-height: 1.5;font-size: 14px; color: #47433F">Estudiar los conceptos b&aacute;sicos de la web sem&aacute;ntica.  </li>
                            <li style="text-align: justify; line-height: 1.5;font-size: 14px; color: #47433F">T&eacute;cnicas y tecnolog&iacute;as que proporcionan una base para la construcci&oacute;n de ontolog&iacute;as   </li>
                            <li style="text-align: justify; line-height: 1.5;font-size: 14px; color: #47433F">Lenguajes de representaci&oacute;n de ontolog&iacute;as m&aacute;s utilizados ( OWL,RDF...).   </li>
                            <li style="text-align: justify; line-height: 1.5;font-size: 14px; color: #47433F">Utilizar y conocer algunas de las herramientas de edici&oacute;n y gesti&oacute;n de ontolog&iacute;as.   </li>
                            <li style="text-align: justify; line-height: 1.5;font-size: 14px; color: #47433F">Aprender a utilizar ontolog&iacute;as para hacer aplicaciones sem&aacute;nticamente   </li>
                            
                            
                            
                            
                        </p>
                </div>
<br><br>
                <button class="accordion" style="font-weight: bold; color:aliceblue">Procesamiento de lenguaje natural mediante t&eacute;cnicas de Deep Learning. </button>
                <div class="panel">
                    <p style="text-align: justify; line-height: 1.5;font-size: 14px; color: #47433F" >Deep learning es una nueva t&eacute;cnica utilizada para el procesamiento de lenguaje natural y que actualmente ha obtenido mejores resultados, sin embargo, existen pocos enfoques aplicados a PLN. En este trabajo se pretende analizar las t&eacute;cnicas Deep learning actuales. <br><br >
                                     
                            Actualmente, existe una gran cantidad de informaci&oacute;n en forma de texto, documentos, p&oacute;ginas personales, noticias, etc. Analizar toda esa informaci&oacute;n se hace muy complicada ya que requiere el conocimiento de distintas &aacute;reas tales como la ling&uuml;&iacute;stica, Procesamiento del Lenguaje Natural, etc. Espec&iacute;ficamente, el Procesamiento del Lenguaje Natural involucra una serie de t&eacute;cnicas para el an&aacute;lisis y representaci&oacute;n de la informaci&oacute;n, que van desde el an&aacute;lisis estad&iacute;stico, etiquetado gramatical hasta la traducci&oacute;n autom&aacute;tica.
                           
                           <br><br>En la carrera de Ingenier&iacute;a en Sistemas Computacionales se han creado temas de investigaci&oacute;n por parte de los docentes que integran el cuerpo acad&eacute;mico &quot;Computo Distribuido&quot; tales como Procesamiento de Lenguaje Natural, Web Sem&aacute;ntica y Deep Learning, estos temas de investigaci&oacute;n se han creado con la finalidad de fomentar el conocimiento cient&iacute;fico hacia los alumnos de la carrera de Ingenier&iacute;a en Sistemas Computacionales. Asimismo para desarrollar proyectos de investigaci&oacute;n que soluciones problemas reales, es necesario realizar investigaci&oacute;n para as&iacute; dar conclusi&oacute;n concreta. Una de las &aacute;reas emergentes en el campo de la inteligencia artificial y machine Learning es el Deep Learning que es una t&eacute;cnica que se enfoca al estudio del procesamiento de leguaje natural.
                           
                           <br><br> En este caso, para la soluci&oacute;n del problema que se presenta en el trabajo de investigaci&oacute;n, es entender y comprender los comportamientos de las herramientas de Deep Learning para la extracci&oacute;n de res&uacute;menes dentro de un documento. 
                           
                           <br><br> Para eso se estudiara los enfoques y herramientas Deep Learning consultando fuentes bibliogr&aacute;ficas en art&iacute;culos y congresos de gran relevancia. Particularmente, se analizaran los desaf&iacute;os en la extracción de res&uacute;menes documentos atreves de distintas t&eacute;cnicas, y particularmente, en Deep Learning. Se ha optado por la utilizaci&oacute;n de Deep Learning para la extracci&oacute;n de res&uacute;menes debido a que se han obtenido resultados eficientes en trabajos de investigaci&oacute;n, sin embargo, existen distintas t&eacute;cnicas por lo que solo se analizaran Long Short-Team Memory (LSTM) y Recurrent neural network (RNN).
                           "</p>
                </div>
<br><br><br><br>
                <script>
                    var acc = document.getElementsByClassName("accordion");
                    var i;

                    for (i = 0; i < acc.length; i++) {
                        acc[i].addEventListener("click", function () {
                            
                            this.classList.toggle("active");

                            
                            var panel = this.nextElementSibling;
                            if (panel.style.display === "block") {
                                panel.style.display = "none";
                            } else {
                                panel.style.display = "block";
                            }
                        });
                    }

                </script>



                <!-- pie de pagina -->
                <div id="content_footer"></div>
                <div id="footer">
                    Copyright &copy; FPM |
                    <a style="color: #333" href="https://www.itsr.edu.mx/">Instituto Tecnol&oacute;gico Superior de los Rios</a> -- Km. 3 carretera Balancan-Villahermosa, Balancan,
                    tabasco C.P. 86930
                </div>
            </div>

</html>